
## Plan Result (stg)




<pre><code>Plan: 2 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_eventgrid_event_subscription.mig-event-supscription
  * azurerm_logic_app_workflow.migration_scan
* Update
  * azurerm_eventgrid_topic.mig-scanner[0]
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_log_analytics_workspace.migration-analytics[0]
  * azurerm_recovery_services_vault.darts-migration-backup[0]
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventgrid_event_subscription.mig-event-supscription will be created
  + resource "azurerm_eventgrid_event_subscription" "mig-event-supscription" {
      + advanced_filtering_on_arrays_enabled = false
      + event_delivery_schema                = "EventGridSchema"
      + eventhub_endpoint_id                 = (known after apply)
      + hybrid_connection_endpoint_id        = (known after apply)
      + id                                   = (known after apply)
      + included_event_types                 = (known after apply)
      + name                                 = "darts-event-stg-subscription"
      + scope                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg"
    }

  # azurerm_eventgrid_topic.mig-scanner[0] will be updated in-place
  ~ resource "azurerm_eventgrid_topic" "mig-scanner" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.EventGrid/topics/darts-event-stg"
        name                          = "darts-event-stg"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://darts-stg.vault.azure.net/secrets/app-insights-connection-string/3b1814adc9804c6a9b0244920be27bf4"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_log_analytics_workspace.migration-analytics[0] will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "migration-analytics" {
        id                                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-analytics-workspace"
        name                                    = "darts-migration-analytics-workspace"
      ~ tags                                    = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_logic_app_workflow.migration_scan will be created
  + resource "azurerm_logic_app_workflow" "migration_scan" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "example-logic-app"
      + resource_group_name             = "darts-migration-stg-rg"
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
              + actions        = {
                  + Execute_PowerShell_Script = {
                      + inputs   = {
                          + body    = {
                              + script = "Your PowerShell script here"
                            }
                          + headers = {
                              + Content-Type = "application/json"
                            }
                          + method  = "POST"
                          + uri     = "<URL of your PowerShell script>"
                        }
                      + runAfter = {
                          + Initialize_variable = [
                              + "Succeeded",
                            ]
                        }
                      + type     = "Http"
                    }
                  + Initialize_variable       = {
                      + inputs   = {
                          + variables = [
                              + {
                                  + name  = "eventData"
                                  + type  = "Object"
                                  + value = "@triggerBody()"
                                },
                            ]
                        }
                      + runAfter = {}
                      + type     = "InitializeVariable"
                    }
                }
              + contentVersion = "1.0.0.0"
              + outputs        = {}
              + triggers       = {
                  + manual = {
                      + inputs = {
                          + schema = {}
                        }
                      + kind   = "Http"
                      + type   = "Request"
                    }
                }
            }
        )
      + workflow_version                = "1.0.0.0"
    }

  # azurerm_recovery_services_vault.darts-migration-backup[0] will be updated in-place
  ~ resource "azurerm_recovery_services_vault" "darts-migration-backup" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv"
        name                          = "darts-prod-rsv"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 5 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Insights/components/darts-stg"
        name                                  = "darts-stg"
        tags                                  = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":213,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->